spec/support/vcr_cassettes/post_cart_pricing.yml

---
http_interactions:
- request:
    method: post
    uri: http://stores.staging.musictoday.com/api/0.4/cart/pricing?apikey=example_api_key&apiuser=example
    body:
      encoding: UTF-8
      string: '{"storeId":12,"currency":"USD","priceLevel":"","addresses":[{"street":"5391
        Three Notched Road","street2":"","state":"Crozet","city":"VA","postalCode":"22932","country":"US","shippingOptionType":"STANDARD","id":1,"items":[{"sku":"AAA002SLBK","qty":1,"quantity":1,"price":24.99}]}],"promotions":[]}'
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Host:
      - stores.staging.musictoday.com
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 28 Jan 2016 15:47:35 GMT
      Server:
      - Wildfly 8
      X-Powered-By:
      - Undertow 1
      Content-Type:
      - application/json;charset=UTF-8
      X-Wildfly-Host:
      - 02q
      Set-Cookie:
      - Coyote-2-1603010a=3e04010a:0; path=/
      - JSESSIONID=WF6iTUxvjzRqgFjmEDm7e9VH.sms-mgr02q; path=/store-api-0.4
      P3p:
      - CP="NOI ADM DEV PSAi COM NAV OUR OTR STP IND DEM"
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Allow-Headers:
      - Origin, X-Requested-With, Content-Type, Accept
      X-Apache-Host:
      - 02p
      Vary:
      - Accept-Encoding
      Content-Length:
      - '74'
      Connection:
      - close
    body:
      encoding: ASCII-8BIT
      string: '{"currency":"USD","addresses":[{"sessionId":"FAKE-SESSION-NUMBER","errors":[],"id":1,"street":"5391 Three Notched Road","street1":"","city":"VA","state":"Crozet","postalCode":"22932","country":"US","preferredShippingOption":"STANDARD","shippingOptions":[],"items":[{"comboSku":"","listPrice":24.99,"name":"Amazing T-Shirt","price":24.99,"quantity":1,"sku":"AAA002SLBK","tax":10.25,"taxRate":0,"total":24.99}],"promotions":[]}]}'
    http_version:
  recorded_at: Thu, 28 Jan 2016 15:47:31 GMT
recorded_with: VCR 3.0.1
